py32duino/Arduino-PY32/variants/PY32F002Axx/PY32F002A_Base/PeripheralPins.c
/*
 *******************************************************************************
 * Copyright (c) 2023, AirM2M
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
/*
 */
#if !defined(CUSTOM_PERIPHERAL_PINS)
#include "Arduino.h"
#include "PeripheralPins.h"

/* =====
 * Notes:
 * - The pins mentioned Px_y_ALTz are alternative possibilities which use other
 *   HW peripheral instances. You can use them the same way as any other "normal"
 *   pin (i.e. analogWrite(PA7_ALT1, 128);).
 *
 * - Commented lines are alternative possibilities which are not used per default.
 *   If you change them, you will have to know what you do
 * =====
 */

//*** ADC ***

#ifdef HAL_ADC_MODULE_ENABLED
WEAK const PinMap PinMap_ADC[] = {
  {PA_0, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 0, 0)}, // ADC_IN0
  {PA_1, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC_IN1
  {PA_2, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC_IN2
  {PA_3, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC_IN3
  {PA_4, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC_IN4
  {PA_5, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC_IN5
  {PA_6, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC_IN6
  {PA_7, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC_IN7
  {PB_0, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC_IN8
  {PB_1, ADC1, PY32_PIN_DATA_EXT(PY32_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC_IN9
  {NC,   NP,   0}
};
#endif

//*** No DAC ***

//*** I2C ***

#ifdef HAL_I2C_MODULE_ENABLED
WEAK const PinMap PinMap_I2C_SDA[] = {
  {PA_2,  I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_7,  I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_9,  I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_10, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PA_12, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PB_7, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PB_8, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PF_0, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {NC,    NP,   0}
};
#endif

#ifdef HAL_I2C_MODULE_ENABLED
WEAK const PinMap PinMap_I2C_SCL[] = {
  {PA_3,  I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_8,  I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_9, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PA_10, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {PA_11, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PB_6, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PB_8, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF6_I2C)},
  {PF_1, I2C, PY32_PIN_DATA(PY32_MODE_AF_OD, GPIO_NOPULL, GPIO_AF12_I2C)},
  {NC,    NP,   0}
};
#endif

//*** TIM ***

#ifdef HAL_TIM_MODULE_ENABLED
WEAK const PinMap PinMap_TIM[] = {
  {PA_0,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF13_TIM1, 3, 0)}, // TIM1_CH3
  {PA_0,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM1, 1, 1)}, // TIM1_CH1N
  {PA_1,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF13_TIM1, 4, 0)}, // TIM1_CH4
  {PA_1,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF14_TIM1, 2, 1)}, // TIM1_CH2N
  {PA_3,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF13_TIM1, 1, 0)}, // TIM1_CH1
  {PA_6,       TIM16,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_TIM16, 1, 0)}, // TIM16_CH1
  {PA_7,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 1, 1)}, // TIM1_CH1N
  {PA_8,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 1, 0)}, // TIM1_CH1
  {PA_9,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 2, 0)}, // TIM1_CH2
  {PA_10,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 3, 0)}, // TIM1_CH3
  {PA_11,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 4, 0)}, // TIM1_CH4
  {PA_13,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF13_TIM1, 2, 0)}, // TIM1_CH2
  {PB_0,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 2, 1)}, // TIM1_CH2N
  {PB_1,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM1, 3, 1)}, // TIM1_CH3N
  {PB_3,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 0)}, // TIM1_CH2
  {PB_6,       TIM16,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM16, 1, 1)}, // TIM16_CH1N
  {PB_5,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 2, 0)}, // TIM1_CH2
  {PB_6,       TIM1,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 3, 0)}, // TIM1_CH3
  {PB_6,       TIM16,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM16, 1, 1)}, // TIM16_CH1N
  {PB_8,       TIM16,  PY32_PIN_DATA_EXT(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM16, 1, 0)}, // TIM16_CH1

  {NC,         NP,    0}
};
#endif

//*** UART ***

#ifdef HAL_UART_MODULE_ENABLED
WEAK const PinMap PinMap_UART_TX[] = {
  {PA_2,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_7,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PA_9,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_10,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PA_14,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PB_6,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_USART1)},
  {PB_8,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PF_1,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PF_3,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_USART1)},

  {NC,    NP,     0}
};
#endif

#ifdef HAL_UART_MODULE_ENABLED
WEAK const PinMap PinMap_UART_RX[] = {
  {PA_3,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_8,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PA_9,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PA_10,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_13,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},
  {PA_15,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PB_2,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_USART1)},
  {PB_7,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_USART1)},
  {PF_0,  USART1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_USART1)},

  {NC,    NP,     0}
};
#endif

#ifdef HAL_UART_MODULE_ENABLED
WEAK const PinMap PinMap_UART_RTS[] = {
  {PA_1,       USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_12,      USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PB_3,      USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_USART1)},

  {NC,    NP,     0}
};
#endif

#ifdef HAL_UART_MODULE_ENABLED
WEAK const PinMap PinMap_UART_CTS[] = {
  {PA_0,       USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PA_11,      USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_USART1)},
  {PB_4,      USART1,  PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_USART1)},

  {NC,    NP,     0}
};
#endif

//*** SPI ***

#ifdef HAL_SPI_MODULE_ENABLED
WEAK const PinMap PinMap_SPI_MOSI[] = {
  {PA_1,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_2,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_3,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_7,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_8,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_12,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PB_5,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},

  {NC,    NP,   0}
};
#endif

#ifdef HAL_SPI_MODULE_ENABLED
WEAK const PinMap PinMap_SPI_MISO[] = {
  {PA_0,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_6,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_7,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_11,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_13,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PB_4,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},

  {NC,    NP,   0}
};
#endif

#ifdef HAL_SPI_MODULE_ENABLED
WEAK const PinMap PinMap_SPI_SCLK[] = {
  {PA_1,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_2,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PA_5,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_9,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PB_3,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},

  {NC,    NP,   0}
};
#endif

#ifdef HAL_SPI_MODULE_ENABLED
WEAK const PinMap PinMap_SPI_SSEL[] = {
  {PA_4,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PA_10,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PB_0,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SPI1)},
  {PF_1,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},
  {PF_3,  SPI1, PY32_PIN_DATA(PY32_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_SPI1)},

  {NC,    NP,   0}
};
#endif

//*** No CAN ***

//*** No ETHERNET ***

//*** No QUADSPI ***

//*** No USB ***

//*** No SD ***

#endif /* !CUSTOM_PERIPHERAL_PINS */
